<script setup lang="ts">
// App 入口
// -- 引入 --------------------------------------------------------------------------------------------
// 手動導入組件，避免自動註冊產生的靜態/動態導入衝突
import LoadingPage from '~/components/loading/page.vue';
import OpenGroup from '~/components/open/group/index.vue';

/** 偵測是否為各大 App 內建瀏覽器 */
UseInAppBrowser();

/** 初始化 */
StoreEnv();
StoreTool();

// -- 資料 --------------------------------------------------------------------------------------------
const $elementI18n = UseElementI18n();
// -- 接收事件 -----------------------------------------------------------------------------------------

// -- 流程 --------------------------------------------------------------------------------------------

// -- 函式 --------------------------------------------------------------------------------------------

// -- Api ---------------------------------------------------------------------------------------------

// -- 生命週期 -----------------------------------------------------------------------------------------

</script>

<template lang="pug">
ElConfigProvider(:locale="$elementI18n.elLocale.value")
  //- 加載橫條
  NuxtLoadingIndicator(color="#86D4A187")

  //- 加載動畫
  LoadingPage

  //- 本體
  NuxtLayout
    NuxtPage

  //- Drawer Modal Dialog 跳窗群組
  OpenGroup
</template>
